codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024eff144.h
#define _CNFH_CNFH1_POSITION                     0x00000001
#define _CNFH_CNFH1_MASK                         0x00000002
#define _CNFH_CNFH1_LENGTH                       0x00000001

#define _CNFH_CNFH2_POSITION                     0x00000002
#define _CNFH_CNFH2_MASK                         0x00000004
#define _CNFH_CNFH2_LENGTH                       0x00000001

#define _CNFH_CNFH3_POSITION                     0x00000003
#define _CNFH_CNFH3_MASK                         0x00000008
#define _CNFH_CNFH3_LENGTH                       0x00000001

#define _CNFH_CNFH4_POSITION                     0x00000004
#define _CNFH_CNFH4_MASK                         0x00000010
#define _CNFH_CNFH4_LENGTH                       0x00000001

#define _CNFH_CNFH5_POSITION                     0x00000005
#define _CNFH_CNFH5_MASK                         0x00000020
#define _CNFH_CNFH5_LENGTH                       0x00000001

#define _CNFH_CNFH6_POSITION                     0x00000006
#define _CNFH_CNFH6_MASK                         0x00000040
#define _CNFH_CNFH6_LENGTH                       0x00000001

#define _CNFH_CNFH7_POSITION                     0x00000007
#define _CNFH_CNFH7_MASK                         0x00000080
#define _CNFH_CNFH7_LENGTH                       0x00000001

#define _CNFH_CNFH8_POSITION                     0x00000008
#define _CNFH_CNFH8_MASK                         0x00000100
#define _CNFH_CNFH8_LENGTH                       0x00000001

#define _CNFH_CNFH9_POSITION                     0x00000009
#define _CNFH_CNFH9_MASK                         0x00000200
#define _CNFH_CNFH9_LENGTH                       0x00000001

#define _CNFH_CNFH10_POSITION                    0x0000000A
#define _CNFH_CNFH10_MASK                        0x00000400
#define _CNFH_CNFH10_LENGTH                      0x00000001

#define _CNFH_CNFH11_POSITION                    0x0000000B
#define _CNFH_CNFH11_MASK                        0x00000800
#define _CNFH_CNFH11_LENGTH                      0x00000001

#define _CNFH_CNFH12_POSITION                    0x0000000C
#define _CNFH_CNFH12_MASK                        0x00001000
#define _CNFH_CNFH12_LENGTH                      0x00000001

#define _CNFH_CNFH13_POSITION                    0x0000000D
#define _CNFH_CNFH13_MASK                        0x00002000
#define _CNFH_CNFH13_LENGTH                      0x00000001

#define _CNFH_CNFH14_POSITION                    0x0000000E
#define _CNFH_CNFH14_MASK                        0x00004000
#define _CNFH_CNFH14_LENGTH                      0x00000001

#define _CNFH_CNFH15_POSITION                    0x0000000F
#define _CNFH_CNFH15_MASK                        0x00008000
#define _CNFH_CNFH15_LENGTH                      0x00000001

#define _ANSELJ_ANSJ8_POSITION                   0x00000008
#define _ANSELJ_ANSJ8_MASK                       0x00000100
#define _ANSELJ_ANSJ8_LENGTH                     0x00000001

#define _ANSELJ_ANSJ9_POSITION                   0x00000009
#define _ANSELJ_ANSJ9_MASK                       0x00000200
#define _ANSELJ_ANSJ9_LENGTH                     0x00000001

#define _ANSELJ_ANSJ11_POSITION                  0x0000000B
#define _ANSELJ_ANSJ11_MASK                      0x00000800
#define _ANSELJ_ANSJ11_LENGTH                    0x00000001

#define _ANSELJ_w_POSITION                       0x00000000
#define _ANSELJ_w_MASK                           0xFFFFFFFF
#define _ANSELJ_w_LENGTH                         0x00000020

#define _TRISJ_TRISJ0_POSITION                   0x00000000
#define _TRISJ_TRISJ0_MASK                       0x00000001
#define _TRISJ_TRISJ0_LENGTH                     0x00000001

#define _TRISJ_TRISJ1_POSITION                   0x00000001
#define _TRISJ_TRISJ1_MASK                       0x00000002
#define _TRISJ_TRISJ1_LENGTH                     0x00000001

#define _TRISJ_TRISJ2_POSITION                   0x00000002
#define _TRISJ_TRISJ2_MASK                       0x00000004
#define _TRISJ_TRISJ2_LENGTH                     0x00000001

#define _TRISJ_TRISJ3_POSITION                   0x00000003
#define _TRISJ_TRISJ3_MASK                       0x00000008
#define _TRISJ_TRISJ3_LENGTH                     0x00000001

#define _TRISJ_TRISJ4_POSITION                   0x00000004
#define _TRISJ_TRISJ4_MASK                       0x00000010
#define _TRISJ_TRISJ4_LENGTH                     0x00000001

#define _TRISJ_TRISJ5_POSITION                   0x00000005
#define _TRISJ_TRISJ5_MASK                       0x00000020
#define _TRISJ_TRISJ5_LENGTH                     0x00000001

#define _TRISJ_TRISJ6_POSITION                   0x00000006
#define _TRISJ_TRISJ6_MASK                       0x00000040
#define _TRISJ_TRISJ6_LENGTH                     0x00000001

#define _TRISJ_TRISJ7_POSITION                   0x00000007
#define _TRISJ_TRISJ7_MASK                       0x00000080
#define _TRISJ_TRISJ7_LENGTH                     0x00000001

#define _TRISJ_TRISJ8_POSITION                   0x00000008
#define _TRISJ_TRISJ8_MASK                       0x00000100
#define _TRISJ_TRISJ8_LENGTH                     0x00000001

#define _TRISJ_TRISJ9_POSITION                   0x00000009
#define _TRISJ_TRISJ9_MASK                       0x00000200
#define _TRISJ_TRISJ9_LENGTH                     0x00000001

#define _TRISJ_TRISJ10_POSITION                  0x0000000A
#define _TRISJ_TRISJ10_MASK                      0x00000400
#define _TRISJ_TRISJ10_LENGTH                    0x00000001

#define _TRISJ_TRISJ11_POSITION                  0x0000000B
#define _TRISJ_TRISJ11_MASK                      0x00000800
#define _TRISJ_TRISJ11_LENGTH                    0x00000001

#define _TRISJ_TRISJ12_POSITION                  0x0000000C
#define _TRISJ_TRISJ12_MASK                      0x00001000
#define _TRISJ_TRISJ12_LENGTH                    0x00000001

#define _TRISJ_TRISJ13_POSITION                  0x0000000D
#define _TRISJ_TRISJ13_MASK                      0x00002000
#define _TRISJ_TRISJ13_LENGTH                    0x00000001

#define _TRISJ_TRISJ14_POSITION                  0x0000000E
#define _TRISJ_TRISJ14_MASK                      0x00004000
#define _TRISJ_TRISJ14_LENGTH                    0x00000001

#define _TRISJ_TRISJ15_POSITION                  0x0000000F
#define _TRISJ_TRISJ15_MASK                      0x00008000
#define _TRISJ_TRISJ15_LENGTH                    0x00000001

#define _TRISJ_w_POSITION                        0x00000000
#define _TRISJ_w_MASK                            0xFFFFFFFF
#define _TRISJ_w_LENGTH                          0x00000020

#define _PORTJ_RJ0_POSITION                      0x00000000
#define _PORTJ_RJ0_MASK                          0x00000001
#define _PORTJ_RJ0_LENGTH                        0x00000001

#define _PORTJ_RJ1_POSITION                      0x00000001
#define _PORTJ_RJ1_MASK                          0x00000002
#define _PORTJ_RJ1_LENGTH                        0x00000001

#define _PORTJ_RJ2_POSITION                      0x00000002
#define _PORTJ_RJ2_MASK                          0x00000004
#define _PORTJ_RJ2_LENGTH                        0x00000001

#define _PORTJ_RJ3_POSITION                      0x00000003
#define _PORTJ_RJ3_MASK                          0x00000008
#define _PORTJ_RJ3_LENGTH                        0x00000001

